{
  "video_id": "QKgbabzdRyU",
  "url": "https://www.youtube.com/watch?v=QKgbabzdRyU",
  "title": "Amazon BSR Best Sellers Rank Explained Amazon Merch BSR Chrome Extension History Chart",
  "channel": "Print on Demand With Ryan A Raymond",
  "publish_date": "20190826",
  "duration_seconds": 1226,
  "view_count": 1209,
  "description": "Does the amazon best sellers rank seem confusing to you?\nIf you want help understanding how to use the best sellers rank to understand the demand for products on amazon you need to take the time to understand the different categories on amazon! \n\nthe Amazon BSR is a very simple algorithm that describes the sales velocity of a product on amazon. \n\nEach category has a different best sellers rank system and you can see this listed directly on each page. \n\nIf you want help seeing the best sellers rank there are many bsr chrome extensions available on the chrome store that provide different levels of detail. \n\nBut my favorite tool to use for amazon merch bsr research is the merchlytics chrome extension by merch informer. \n\nYou get it included in your subscription when you subscribe to merch informer. \nBTW you can get 20% off with this merch informer discount code RYAN \nand you can sign up for merch informer using my affiliate link below!\nhttp://www.ryanaraymond.com/INFORMER\nBe sure to subsc",
  "tags": [
    "Amazon BSR",
    "amazon bsr chrome extension",
    "amazon bsr history",
    "amazon bsr chart",
    "bsr amazon merch",
    "amazon fba",
    "selling on amazon",
    "retail arbitrage",
    "fba",
    "bsr",
    "sell on amazon",
    "private label",
    "amazon bsr explained",
    "best seller rank",
    "amazon sales rank",
    "seller",
    "how to sell on amazon",
    "what to sell on amazon",
    "how to make money online",
    "how to sell on amazon fba",
    "amazon",
    "amazon fba product research",
    "passive income",
    "just one dime",
    "entrepreneur",
    "entrepreneurship",
    "Merch By Amazon",
    "Amazon merch"
  ],
  "transcript_lang": "auto",
  "transcript_word_count": 3515,
  "collected_at": "2026-02-19T00:53:35.749909"
}