{
  "video_id": "ceHBNpN3EcY",
  "url": "https://www.youtube.com/watch?v=ceHBNpN3EcY",
  "title": "Amazon KDP Tutorial for Beginners – Keyword Research That Works (2026)",
  "channel": "The Silent Publisher",
  "publish_date": "20260105",
  "duration_seconds": 755,
  "view_count": 608,
  "description": "If you’re new to Amazon KDP or struggling to get your books to rank, this Amazon KDP tutorial for beginners will show you how to do keyword research the right way in 2026. In this video, I break down a simple but powerful Amazon KDP keyword strategy that helps you find the right KDP keywords, rank faster, and get more visibility for your books on Amazon.\n\n\nThis step-by-step Amazon KDP tutorial is perfect for beginners and intermediate publishers who want to understand how keyword research works for Kindle Direct Publishing. You’ll learn how to find profitable Amazon KDP keywords, avoid common beginner mistakes, and use keyword research to rank books on Amazon KDP even if you’re just getting started.\n\n\nAmazon KDP is constantly changing, and the keyword strategy that worked last year may not work in 2026. That’s why this video focuses on updated Amazon KDP keyword research, KDP SEO basics, and how the Amazon KDP algorithm uses keywords to decide which books to show buyers.\n\n📌 WHAT YOU’LL",
  "tags": [
    "amazon kdp tutorial for beginners",
    "amazon kdp for beginners",
    "amazon kdp keyword research",
    "kdp keyword research",
    "amazon kdp keywords",
    "amazon kdp",
    "amazon self publishing",
    "kdp publishing",
    "kdp keywords",
    "amazon kdp seo",
    "keyword research",
    "how to find kdp keywords",
    "how to rank books on amazon",
    "amazon publishing tutorial",
    "self publishing on amazon",
    "amazon kdp tips",
    "kdp tutorial",
    "amazon kdp 2026",
    "kdp 2026",
    "amazon publishing 2026",
    "make money with amazon kdp",
    "silent publisher"
  ],
  "transcript_lang": "auto",
  "transcript_word_count": 1730,
  "collected_at": "2026-02-18T03:28:24.246479"
}