{
  "video_id": "J3xr-1oJHZs",
  "url": "https://www.youtube.com/watch?v=J3xr-1oJHZs",
  "title": "Best Selling Books on Amazon KDP : The Truth About Amazon Best Sellers Rank - BSR & Earnings",
  "channel": "Self-Publishing 201",
  "publish_date": "20250115",
  "duration_seconds": 799,
  "view_count": 2858,
  "description": "Best Selling Books on Amazon KDP — What’s the typical pattern for popular YouTube videos about #amazonkdp  ? It’s pretty predictable. They start off claiming they’ve just discovered a brand new, super-secret low-content book niche where one book is supposedly making $10,000 a month or more. Then, to sell you on the dream, they quickly flash the book’s BSR, pull up an Amazon #kdp Sales Calculator, and show you some eye-popping sales and royalty estimates—all to convince you that you can do it too. Sound familiar? Of course, it does—there are thousands of these videos all over YouTube.\nToday, we’re cutting through the nonsense. I’ll walk you through the official information straight from Amazon’s Help Center and KDP Help Center. Stay with me as I explain what Amazon BSR really is, how it’s calculated, and uncover the real cost of earning $10,000 a month—or more—on Amazon with a detailed example about The Real Cost of Earning $10,000 with #amazonads  at the end of this video. It’s somethi",
  "tags": [
    "how to make low content books for amazon",
    "Amazon KDP",
    "low content books",
    "self-publishing",
    "kdp publishing tutorial",
    "low content book publishing",
    "kdp low content books",
    "make money online",
    "sell books on amazon",
    "kdp amazon step by step",
    "amazon kdp for beginners",
    "amazon kdp tutorial",
    "kdp",
    "amazon kdp",
    "kdp amazon",
    "self published books",
    "amazon kdp coloring book",
    "amazon kdp earnings",
    "amazon kdp 2025",
    "amazonads",
    "amazon kdp ads",
    "amazon kdp ads for beginners",
    "amazon kdp ads strategy 2025"
  ],
  "transcript_lang": "manual",
  "transcript_word_count": 2364,
  "collected_at": "2026-02-18T19:45:02.445951"
}