{
  "video_id": "ktVqeQZ3IP8",
  "url": "https://www.youtube.com/watch?v=ktVqeQZ3IP8",
  "title": "Google Discover Core Update, Listicles Hit, Google Ads, ChatGPT Ads Ready & Pub Content Marketplace",
  "channel": "RustyBrick Barry Schwartz Search Engine Roundtable",
  "publish_date": "20260206",
  "duration_seconds": 769,
  "view_count": 1448,
  "description": "This week, we covered the first core update of 2026, the February 2026 Discover core update. Meanwhile, there is an ongoing super-heated and volatile Google search rankings. Google has nothing to share about the recent unconfirmed ranking updates. Google said its search algorithms, spam detection, spam policies did not fundamentally change with AI Search. Google spoke about its top crawling challenges in 2025. Google posts more details on its file limits for Googlebot crawling. I posted the monthly Google webmaster report in February. Bing announced the global roll out of what it calls multi-turn search. ChatGPT readies its ads with ad code in the results. Google is showing a lot of ads in the local pack now. Mike Ryan did a report on invalid clicks across the Google Ad Network. Google Ads is replacing its contact support form with an AI agent. Google Ads has a new multi-party approval process for enhanced security. Google AdSense has new reporting for browser, hosting app and operatin",
  "tags": [
    "seo",
    "sem",
    "ppc",
    "google",
    "search",
    "google ranking",
    "google update",
    "listicles",
    "ai",
    "crawling",
    "googlebot",
    "spiders",
    "bing",
    "microsoft",
    "copilot",
    "chatgpt",
    "openai",
    "ads",
    "search ads",
    "ai ads",
    "google ad network",
    "google local",
    "google local pack",
    "google adsense",
    "microsoft advertising",
    "content",
    "publishers",
    "news",
    "video",
    "security",
    "google ai overviews",
    "google discover",
    "google core update",
    "google algorithm update"
  ],
  "transcript_lang": "auto",
  "transcript_word_count": 2716,
  "collected_at": "2026-02-25T02:59:07.661119"
}