{
  "video_id": "X9symR5eNcY",
  "url": "https://www.youtube.com/watch?v=X9symR5eNcY",
  "title": "My KDP Book Got Inside The TOP 100 Of All Books On Amazon! - How Much Money Did It Make?!",
  "channel": "KDP Erik",
  "publish_date": "20230807",
  "duration_seconds": 521,
  "view_count": 938,
  "description": "When I began publishing on KDP four years ago, I never believed that I could get a book inside the top 1000 on Amazon, let alone the top 100. I always thought these ranks were reserved for celebrities and well-established authors and always wondered how many sales a book ranking this high would make.\n\nThis all changed last year when I published a relatively simple book that only took me about 20 hours to make. It shot up the rankings immediately, eclipsing my previous best, and soon made it all the way into the top 100. But just how high did it go?\n\nIn this video, I start off by explaining how the ranking system on Amazon works and what a good rank for a KDP book normally is. I then show you the progression of the Best-Seller-Rank of my highest ranking book ever, before revealing its overall royalties, what its ad spend was and most importantly: its overall profit. Is it my best-selling book of all time?\n\nMake sure to watch until the end where I give you vital advice about evergreen an",
  "tags": [
    "amazon kdp",
    "low content books",
    "self publishing",
    "kdp",
    "amazon kdp for beginners",
    "amazon kdp tutorial",
    "amazon kdp strategy",
    "kdp strategy",
    "kdp tutorial",
    "march income report",
    "kdp income report",
    "kdp challenge",
    "kindle direct publishing",
    "kdp course",
    "kdp low content books",
    "kdp publishing",
    "online money challenge",
    "kdp story",
    "kdp medium content",
    "kdp high content",
    "amazon kdp upload book",
    "amazon kdp earnings",
    "kdp sales",
    "kdp report",
    "kdp tips",
    "kdp advertising",
    "kdp keywords"
  ],
  "transcript_lang": "auto",
  "transcript_word_count": 2066,
  "collected_at": "2026-02-18T19:45:32.657793"
}