{
  "video_id": "MWQcvVMA6Bk",
  "url": "https://www.youtube.com/watch?v=MWQcvVMA6Bk",
  "title": "Watch This BEFORE You Publish a Book on Amazon KDP (Biggest Beginner Mistakes)",
  "channel": "Sean Dollwet",
  "publish_date": "20251121",
  "duration_seconds": 887,
  "view_count": 8076,
  "description": "📞 Book a free call to apply for our KDP mentorship program and get expert feedback on your book idea, niche, and strategy — plus a custom game plan: http://pages.royaltyhero.com/yt-apply?utm_content=MWQcvVMA6Bk\n\n🚀 Write and Publish Your First Book in Just 7 Days: https://seandollwet.com/7dbc\n\n► Get Book Reviews Fast and Easy: https://seandollwet.com/bookbounty\n\n► DFY Service That Runs All of My Amazon Ads: https://seandollwet.com/adsology\n\n\n⚠️ DISCLAIMER: The information shared in this channel is for educational and informational purposes only. There is NO GUARANTEE that you will earn money using the techniques and ideas in this video. This is NOT a get-rich-quick scheme, financial Advice, or investment advice. Earnings shown are examples only, and your results will vary. Your investments are solely your responsibility and it is imperative that you conduct your own research. I am merely sharing my opinion with no guarantee of gains or losses on investments. Your level of success in att",
  "tags": [
    "self publishing",
    "amazon kdp",
    "how to make money online",
    "amazon kdp publishing",
    "low content books",
    "low content publishing",
    "kdp income report",
    "kdp niche research",
    "kdp low content",
    "Audiobook Publishing",
    "write a book with chatgpt",
    "how to write a book",
    "self publishing on amazon",
    "how to write a book with ai",
    "how to publish a book",
    "how to publish a book on amazon",
    "kdp publishing",
    "amazon kdp for beginners",
    "amazon kdp coloring book",
    "amazon kdp tutorial",
    "How to Write an ebook with AI"
  ],
  "transcript_lang": "auto",
  "transcript_word_count": 3357,
  "collected_at": "2026-02-18T03:26:45.384162"
}