{
  "video_id": "1wf8cxiVYW8",
  "url": "https://www.youtube.com/watch?v=1wf8cxiVYW8",
  "title": "Do THIS Instead of KDP Low Content Books!",
  "channel": "Jungle Scout",
  "publish_date": "20220823",
  "duration_seconds": 1625,
  "view_count": 1885227,
  "description": "There is WAY too much competition for anyone just starting out with Amazon KDP, and Amazon is actually discouraging new sellers from making low content books. So what should you do instead? \n\nWe'll show you how to make passive income by launching your first MEDIUM CONTENT KDP coloring book. But not only that, we'll show you how to do it the SMART way. And by \"the smart way,\" we mean launching a medium content book in a niche with high demand, low competition, & high royalties. Does that sound like something you're interested in? Then keep watching! We'll show you what sets medium content books apart, how to identify a niche to launch your book in, create your book, & how to publish it on Amazon KDP.\n\nBut not only that, we'll show you how to do this entirely for FREE.\n\nLaunching a medium content book on Amazon's print on demand service (KDP) means you don't need to be an author or a designer to get started, and you don't need to own any of your own inventory. You just need to know how t",
  "tags": [
    "Amazon kdp",
    "low content books",
    "kdp low content books",
    "amazon kdp for beginners",
    "self publishing",
    "kdp niche research",
    "kdp",
    "amazon kindle publishing",
    "kdp niches 2022",
    "amazon kdp publishing",
    "amazon kdp tutorial",
    "kindle direct publishing",
    "jungle scout",
    "junglescout",
    "make money on amazon",
    "side hustle",
    "make money online",
    "kdp medium content",
    "canva kdp book cover",
    "canva kdp",
    "coloring books kdp",
    "canva coloring books",
    "low content coloring book",
    "kdp free tools",
    "amazon kdp free"
  ],
  "transcript_lang": "manual",
  "transcript_word_count": 5989,
  "collected_at": "2026-02-18T03:24:36.768473"
}